In [16]:
import pandas as pd

df = pd.read_csv('corrected_matches.csv')
df1 = pd.read_csv('1_21_25_Manual_Dups.csv')

In [17]:
df.shape

(659, 3)

In [23]:
df1 = df1.drop_duplicates()
df1.shape

(189, 3)

In [19]:
m = df.merge(df1,on=['Name','School'],how='inner')

In [20]:
m.shape

(179, 4)

In [21]:
m.head()
# Keep ID_x
m = m.drop('ID_y',axis=1)
m = m.rename(columns={'ID_x': 'ID'})
m.head(10)

        ID           Name                             School
0  1653662   Kyle Johnson                    Mary Washington
1   403694    Lauren Gray                     Incarnate Word
2   289498   Ali Harrison  University of California-Berkeley
3   289498   Ali Harrison                    Duke University
4   388400   Megan Morris         Texas Christian University
5   522063    Alex Watson                              Maine
6  1152013    Alex Watson                      Johns Hopkins
7   491898  Andrew Martin                  Xavier University
8   404009    Sam Russell  Rochester Institute of Technology
9   480528    Sam Russell                         Bellarmine

In [22]:
m.shape

(179, 3)

In [14]:
# Perform a merge with the indicator parameter
merged_df = m.merge(df1, on=['ID', 'Name', 'School'], how='outer', indicator=True)

# Filter rows that are only in df (left_only)
rows_not_in_inner_merge = merged_df[merged_df['_merge'] == 'left_only']

# Display the result
print(rows_not_in_inner_merge)

          ID           Name                           School     _merge
8     241007   Caroline Lee  Georgia Institute of Technology  left_only
9     262846      Alex King           University of Michigan  left_only
10    268549   Joshua Brown             Salisbury University  left_only
11    271699   Landon Clark                Xavier University  left_only
12    271724  Jake Williams         West Virginia University  left_only
..       ...            ...                              ...        ...
357  2304891   Matthew Cole                 Hartwick College  left_only
360  2663727  Mia Destefani              Keene State College  left_only
361  2663727  Mia Destefani                    Southern Conn  left_only
362  2709114    Emily Jones            University of Alabama  left_only
363  2906510  Summer Martin     Bridgewater State University  left_only

[179 rows x 4 columns]

In [24]:
m1 = m.drop('ID',axis=1)
m2 = df1.drop('ID',axis=1)

In [25]:
m1['Name_School'] = m1['Name'] + ' - ' + m1['School']

In [26]:
m2['Name_School'] = m2['Name'] + ' - ' + m2['School']

In [31]:
array1 = m1.Name_School.values
array2 = m2.Name_School.values

In [33]:
import numpy as np
difference = np.setdiff1d(array1, array2)

In [35]:
for combo in array2:
    if (combo not in array1):
        print(combo)

Jacob Berkheimer - Missouri State Aquatics
Corbett Wilson - Missouri State Aquatics
Jason Allen - Missouri State Aquatics
Nathan Moore - University of Texas
Haley Angelo - Missouri State Aquatics
Rebecca Schmidt - Augustana College
Caleb Whittington - Missouri State Aquatics
Quinn McCurry - Missouri State Aquatics
Kevin Chen - Missouri State Aquatics
Jason Lee - Connecticut College
Andrew Johnson - Missouri State Aquatics

In [36]:
m4 = pd.read_csv('extra_10.csv')
m = pd.concat([m,m4])

In [39]:
m.shape

(189, 3)

In [38]:
m = m.drop_duplicates()

In [40]:
m.to_csv('1_21_25_correcteddups.csv',index=False)